podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKW41Z4.svd.xml
            <register>
               <name>SDID</name>
               <description>System Device Identification Register</description>
               <addressOffset>0x1024</addressOffset>
               <access>read-only</access>
               <resetValue>0x5F0000</resetValue>
               <fields>
                  <field>
                     <name>PINID</name>
                     <description>Pin count Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>48-pin</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIEID</name>
                     <description>Device Die Number</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>REVID</name>
                     <description>Device Revision Number</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRAMSIZE</name>
                     <description>System SRAM Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>128 KB</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>64 KB</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SERIESID</name>
                     <description>Kinetis Series ID</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>KW family</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SUBFAMID</name>
                     <description>Kinetis Sub-Family ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>KWx0 Subfamily</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>KWx1 Subfamily</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>KWx2 Subfamily</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>KWx3 Subfamily</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAMID</name>
                     <description>Kinetis family ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>KW2x Family (802.15.4)</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>KW3x Family (BTLE)</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>KW4x Family (802.15.4, BTLE, GFSK , ANT)</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC4</name>
               <description>System Clock Gating Control Register 4</description>
               <addressOffset>0x1034</addressOffset>
               <resetValue>0xF0000030</resetValue>
               <fields>
                  <field>
                     <name>CMT</name>
                     <description>CMT Clock Gate Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CMT" > <name>I2C0</name> <description>I2C0 Clock Gate Control</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CMT" > <name>I2C1</name> <description>I2C1 Clock Gate Control</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="CMT" > <name>CMP</name> <description>Comparator Clock Gate Control</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="CMT" > <name>VREF</name> <description>VREF Clock Gate Control</description> <bitOffset>20</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC5</name>
               <description>System Clock Gating Control Register 5</description>
               <addressOffset>0x1038</addressOffset>
               <resetValue>0x2000182</resetValue>
               <fields>
                  <field>
                     <name>LPTMR</name>
                     <description>Low Power Timer Access Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Access disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Access enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="LPTMR" > <name>TSI</name> <description>TSI Access Control</description> <bitOffset>5</bitOffset> </field>
                  <field>
                     <name>PORTA</name>
                     <description>Port A Clock Gate Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PORTA" > <name>PORTB</name> <description>Port B Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PORTC</name> <description>Port C Clock Gate Control</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>LPUART0</name> <description>LPUART0 Clock Gate Control</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>LTC</name> <description>LTC Clock Gate Control</description> <bitOffset>24</bitOffset> </field>
                  <field>
                     <name>RSIM</name>
                     <description>RSIM Clock Gate Control</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field derivedFrom="PORTA" > <name>DCDC</name> <description>DCDC Clock Gate Control</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>BTLL</name> <description>BTLL System Clock Gate Control</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PHYDIG</name> <description>PHY Digital Clock Gate Control</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>ZigBee</name> <description>802.15.4 Clock Gate Control</description> <bitOffset>29</bitOffset> </field>
                  <field>
                     <name>ANT</name>
                     <description>ANT Clock Gate Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>ANT CGC bit disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ANT CGC bit can be enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GEN_FSK</name>
                     <description>Generic FSK enabled</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>GFSK CGC bit disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>GFSK CGC bit enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC6</name>
               <description>System Clock Gating Control Register 6</description>
               <addressOffset>0x103C</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>FTF</name>
                     <description>Flash Memory Clock Gate Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FTF" > <name>DMAMUX0</name> <description>DMA Mux Clock Gate Control</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>TRNG</name> <description>TRNG Clock Gate Control</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>SPI0</name> <description>SPI0 Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>SPI1</name> <description>SPI1 Clock Gate Control</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>PIT</name> <description>PIT Clock Gate Control</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>TPM0</name> <description>TPM0 Clock Gate Control</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>TPM1</name> <description>TPM1 Clock Gate Control</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>TPM2</name> <description>TPM2 Clock Gate Control</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>ADC0</name> <description>ADC0 Clock Gate Control</description> <bitOffset>27</bitOffset> </field>
                  <field>
                     <name>RTC</name>
                     <description>RTC Access Control</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Access and interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Access and interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FTF" > <name>DAC0</name> <description>DAC0 Clock Gate Control</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC7</name>
               <description>System Clock Gating Control Register 7</description>
               <addressOffset>0x1040</addressOffset>
               <resetValue>0x100</resetValue>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>DMA Clock Gate Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKDIV1</name>
               <description>System Clock Divider Register 1</description>
               <addressOffset>0x1044</addressOffset>
               <resetValue>0x10000</resetValue>
               <fields>
                  <field>
                     <name>OUTDIV4</name>
                     <description>Clock 4 Output Divider value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Divide-by-1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Divide-by-2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Divide-by-3</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Divide-by-4</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Divide-by-5</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Divide-by-6</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>Divide-by-7</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>Divide-by-8</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV1</name>
                     <description>Clock 1 Output Divider value</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>Divide-by-1</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Divide-by-2</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Divide-by-3</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Divide-by-4</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>Divide-by-5</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>Divide-by-6</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Divide-by-7</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>Divide-by-8</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Divide-by-9</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>Divide-by-10</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>Divide-by-11</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Divide-by-12</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>Divide-by-13</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>Divide-by-14</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>Divide-by-15</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Divide-by-16</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
